-- MySQL dump 10.13  Distrib 8.0.17, for Win64 (x86_64)
--
-- Host: localhost    Database: javademo
-- ------------------------------------------------------
-- Server version	8.0.17

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `admin`
--

DROP TABLE IF EXISTS `admin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `account` varchar(30) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin`
--

LOCK TABLES `admin` WRITE;
/*!40000 ALTER TABLE `admin` DISABLE KEYS */;
INSERT INTO `admin` VALUES (1,'admin','e10adc3949ba59abbe56e057f20f883e'),(2,'lcc','25f9e794323b453885f5181f1b624d0b');
/*!40000 ALTER TABLE `admin` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `auth`
--

DROP TABLE IF EXISTS `auth`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `auth` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `account` varchar(30) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `auth`
--

LOCK TABLES `auth` WRITE;
/*!40000 ALTER TABLE `auth` DISABLE KEYS */;
INSERT INTO `auth` VALUES (1,'lcc','e10adc3949ba59abbe56e057f20f883e'),(2,'lccgood','e10adc3949ba59abbe56e057f20f883e');
/*!40000 ALTER TABLE `auth` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(30) DEFAULT NULL,
  `price` int(11) DEFAULT NULL,
  `cost` int(11) DEFAULT NULL,
  `info` text,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product`
--

LOCK TABLES `product` WRITE;
/*!40000 ALTER TABLE `product` DISABLE KEYS */;
INSERT INTO `product` VALUES (1,'iPhone14',32500,25000,'這是2022年最新款的iPhone手機');
/*!40000 ALTER TABLE `product` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `twtrain`
--

DROP TABLE IF EXISTS `twtrain`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `twtrain` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(15) DEFAULT NULL,
  `city` varchar(15) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=243 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `twtrain`
--

LOCK TABLES `twtrain` WRITE;
/*!40000 ALTER TABLE `twtrain` DISABLE KEYS */;
INSERT INTO `twtrain` VALUES (1,'基隆',NULL),(2,'三坑',NULL),(3,'八堵',NULL),(4,'七堵',NULL),(5,'百福',NULL),(6,'五堵',NULL),(7,'汐止',NULL),(8,'汐科',NULL),(9,'南港',NULL),(10,'松山',NULL),(11,'臺北',NULL),(12,'臺北-環島',NULL),(13,'萬華',NULL),(14,'板橋',NULL),(15,'浮洲',NULL),(16,'樹林',NULL),(17,'南樹林',NULL),(18,'山佳',NULL),(19,'鶯歌',NULL),(20,'桃園',NULL),(21,'內壢',NULL),(22,'中壢',NULL),(23,'埔心',NULL),(24,'楊梅',NULL),(25,'富岡',NULL),(26,'新富',NULL),(27,'北湖',NULL),(28,'湖口',NULL),(29,'新豐',NULL),(30,'竹北',NULL),(31,'北新竹',NULL),(32,'千甲',NULL),(33,'新莊',NULL),(34,'竹中',NULL),(35,'六家',NULL),(36,'上員',NULL),(37,'榮華',NULL),(38,'竹東',NULL),(39,'橫山',NULL),(40,'九讚頭',NULL),(41,'合興',NULL),(42,'富貴',NULL),(43,'內灣',NULL),(44,'新竹',NULL),(45,'三姓橋',NULL),(46,'香山',NULL),(47,'崎頂',NULL),(48,'竹南',NULL),(49,'談文',NULL),(50,'大山',NULL),(51,'後龍',NULL),(52,'龍港',NULL),(53,'白沙屯',NULL),(54,'新埔',NULL),(55,'通霄',NULL),(56,'苑裡',NULL),(57,'日南',NULL),(58,'大甲',NULL),(59,'臺中港',NULL),(60,'清水',NULL),(61,'沙鹿',NULL),(62,'龍井',NULL),(63,'大肚',NULL),(64,'追分',NULL),(65,'造橋',NULL),(66,'豐富',NULL),(67,'苗栗',NULL),(68,'南勢',NULL),(69,'銅鑼',NULL),(70,'三義',NULL),(71,'泰安',NULL),(72,'后里',NULL),(73,'豐原',NULL),(74,'栗林',NULL),(75,'潭子',NULL),(76,'頭家厝',NULL),(77,'松竹',NULL),(78,'太原',NULL),(79,'精武',NULL),(80,'臺中',NULL),(81,'五權',NULL),(82,'大慶',NULL),(83,'烏日',NULL),(84,'新烏日',NULL),(85,'成功',NULL),(86,'彰化',NULL),(87,'花壇',NULL),(88,'大村',NULL),(89,'員林',NULL),(90,'永靖',NULL),(91,'社頭',NULL),(92,'田中',NULL),(93,'二水',NULL),(94,'源泉',NULL),(95,'濁水',NULL),(96,'龍泉',NULL),(97,'集集',NULL),(98,'水里',NULL),(99,'車埕',NULL),(100,'林內',NULL),(101,'石榴',NULL),(102,'斗六',NULL),(103,'斗南',NULL),(104,'石龜',NULL),(105,'大林',NULL),(106,'民雄',NULL),(107,'嘉北',NULL),(108,'嘉義',NULL),(109,'水上',NULL),(110,'南靖',NULL),(111,'後壁',NULL),(112,'新營',NULL),(113,'柳營',NULL),(114,'林鳳營',NULL),(115,'隆田',NULL),(116,'拔林',NULL),(117,'善化',NULL),(118,'南科',NULL),(119,'新市',NULL),(120,'永康',NULL),(121,'大橋',NULL),(122,'臺南',NULL),(123,'保安',NULL),(124,'仁德',NULL),(125,'中洲',NULL),(126,'長榮大學',NULL),(127,'沙崙',NULL),(128,'大湖',NULL),(129,'路竹',NULL),(130,'岡山',NULL),(131,'橋頭',NULL),(132,'楠梓',NULL),(133,'新左營',NULL),(134,'左營',NULL),(135,'內惟',NULL),(136,'美術館',NULL),(137,'鼓山',NULL),(138,'三塊厝',NULL),(139,'高雄',NULL),(140,'民族',NULL),(141,'科工館',NULL),(142,'正義',NULL),(143,'鳳山',NULL),(144,'後庄',NULL),(145,'九曲堂',NULL),(146,'六塊厝',NULL),(147,'屏東',NULL),(148,'歸來',NULL),(149,'麟洛',NULL),(150,'西勢',NULL),(151,'竹田',NULL),(152,'潮州',NULL),(153,'崁頂',NULL),(154,'南州',NULL),(155,'鎮安',NULL),(156,'林邊',NULL),(157,'佳冬',NULL),(158,'東海',NULL),(159,'枋寮',NULL),(160,'加祿',NULL),(161,'內獅',NULL),(162,'枋山',NULL),(163,'枋野',NULL),(164,'大武',NULL),(165,'瀧溪',NULL),(166,'金崙',NULL),(167,'太麻里',NULL),(168,'知本',NULL),(169,'康樂',NULL),(170,'潮州基地',NULL),(171,'臺東',NULL),(172,'山里',NULL),(173,'鹿野',NULL),(174,'瑞源',NULL),(175,'瑞和',NULL),(176,'關山',NULL),(177,'海端',NULL),(178,'池上',NULL),(179,'富里',NULL),(180,'東竹',NULL),(181,'東里',NULL),(182,'玉里',NULL),(183,'三民',NULL),(184,'瑞穗',NULL),(185,'富源',NULL),(186,'大富',NULL),(187,'光復',NULL),(188,'萬榮',NULL),(189,'鳳林',NULL),(190,'南平',NULL),(191,'林榮新光',NULL),(192,'豐田',NULL),(193,'壽豐',NULL),(194,'平和',NULL),(195,'志學',NULL),(196,'吉安',NULL),(197,'花蓮',NULL),(198,'北埔',NULL),(199,'景美',NULL),(200,'新城',NULL),(201,'崇德',NULL),(202,'和仁',NULL),(203,'和平',NULL),(204,'漢本',NULL),(205,'武塔',NULL),(206,'南澳',NULL),(207,'東澳',NULL),(208,'永樂',NULL),(209,'蘇澳',NULL),(210,'蘇澳新',NULL),(211,'新馬',NULL),(212,'冬山',NULL),(213,'羅東',NULL),(214,'中里',NULL),(215,'二結',NULL),(216,'宜蘭',NULL),(217,'四城',NULL),(218,'礁溪',NULL),(219,'頂埔',NULL),(220,'頭城',NULL),(221,'外澳',NULL),(222,'龜山',NULL),(223,'大溪',NULL),(224,'大里',NULL),(225,'石城',NULL),(226,'福隆',NULL),(227,'貢寮',NULL),(228,'雙溪',NULL),(229,'牡丹',NULL),(230,'三貂嶺',NULL),(231,'大華',NULL),(232,'十分',NULL),(233,'望古',NULL),(234,'嶺腳',NULL),(235,'平溪',NULL),(236,'菁桐',NULL),(237,'猴硐',NULL),(238,'瑞芳',NULL),(239,'海科館',NULL),(240,'八斗子',NULL),(241,'四腳亭',NULL),(242,'暖暖',NULL);
/*!40000 ALTER TABLE `twtrain` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `twtrainall`
--

DROP TABLE IF EXISTS `twtrainall`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `twtrainall` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `stname` varchar(15) DEFAULT NULL,
  `estname` varchar(50) DEFAULT NULL,
  `staddress` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=383 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `twtrainall`
--

LOCK TABLES `twtrainall` WRITE;
/*!40000 ALTER TABLE `twtrainall` DISABLE KEYS */;
INSERT INTO `twtrainall` VALUES (1,'基隆','Keelung','基隆市中山區民治里1鄰中山一路16之 1號'),(2,'三坑','Sankeng','基隆市仁愛區德厚里龍安街 206 號'),(3,'八堵','Badu','基隆市暖暖區八南里八堵路 142 號'),(4,'七堵','Qidu','基隆市七堵區長興里東新街 2 號'),(5,'百福','Baifu','基隆市七堵區堵南里明德三路 1 之 1 號'),(6,'五堵','Wudu','新北市汐止區長安里長安路 17 號'),(7,'汐止','Xizhi','新北市汐止區信望里信義路 1 號'),(8,'汐科','Xike','新北市汐止區大同里大同路二段 182 號'),(9,'南港','Nangang','臺北市南港區南港里南港路一段 313 號'),(10,'松山','Songshan','臺北市信義區永吉里松山路 11 號B1'),(11,'臺北','Taipei','臺北市中正區黎明里北平西路 3 號'),(12,'臺北-環島','Taipei Surround Island','臺北市中正區'),(13,'萬華','Wanhua','臺北市萬華區富福里康定路 382 號'),(14,'板橋','Banqiao','新北市板橋區新民里站前路'),(15,'浮洲','Fuzhou','新北市板橋區僑中里僑中二街 156 號'),(16,'樹林','Shulin','新北市樹林區樹北里鎮前街 112 號'),(17,'南樹林','South Shulin','新北市樹林區東山里中山路二段 230 號'),(18,'山佳','Shanjia','新北市樹林區中山里山佳街 28 號'),(19,'鶯歌','Yingge','新北市鶯歌區東鶯里文化路 68-1號'),(20,'桃園','Taoyuan','桃園市桃園區武陵里中正路 1 號'),(21,'內壢','Neili','桃園市中壢區中原里中華路一段 267 號'),(22,'中壢','Zhongli_Taoyuan','桃園市中壢區石頭里中和路 139 號'),(23,'埔心','Puxin','桃園市楊梅區埔心里永美路 208 號'),(24,'楊梅','Yangmei','桃園市楊梅區楊梅里大成路 256 號'),(25,'富岡','Fugang','桃園市楊梅區富岡里成功路 37 號'),(26,'新富','Xinfu','桃園市楊梅區富豐里富全街 1 號'),(27,'北湖','Beihu','新竹縣湖口鄉東興村北湖路 1 號'),(28,'湖口','Hukou','新竹縣湖口鄉仁勢村中山路二段 121 號'),(29,'新豐','Xinfeng','新竹縣新豐鄉山崎村新興路 202 號'),(30,'竹北','Zhubei','新竹縣竹北市竹義里和平街 59 號'),(31,'北新竹','North Hsinchu','新竹市 東區東園里中華路一段 291 之 2 號'),(32,'千甲','Qianjia','新竹市 東區水源里千甲路 142 號'),(33,'新莊','Xinzhuang','新竹市 東區新莊里關東路 310 號'),(34,'竹中','Zhuzhong','新竹縣竹東鎮頭重里竹中路 145 號'),(35,'六家','Liujia','新竹縣竹北市隘口里復興三路二段 229 號'),(36,'上員','Shangyuan','新竹縣竹東鎮上員里光明路 (無站房)'),(37,'榮華','Ronghua','新竹縣竹東鎮仁愛里北興路 (無站房)'),(38,'竹東','Zhudong','新竹縣竹東鎮雞林里東林路 196 號'),(39,'橫山','Hengshan','新竹縣橫山鄉橫山村橫山路 97 號 (無站房)'),(40,'九讚頭','Jiuzantou','新竹縣橫山鄉大肚村中豐路二段 286 巷 29 號'),(41,'合興','Hexing','新竹縣橫山鄉力行村中山街一段 17 號'),(42,'富貴','Fugui','新竹縣橫山鄉豐田村中山街一段 (無站房)'),(43,'內灣','Neiwan','新竹縣橫山鄉內灣村中正路 6 號'),(44,'新竹','Hsinchu','新竹市 東區榮光里中華路二段 445 號'),(45,'三姓橋','Sanxingqiao','新竹市 香山區香山里元培街 32 巷 30 號'),(46,'香山','Xiangshan','新竹市 香山區朝山里中華路五段 347 巷 2 弄 27 號'),(47,'崎頂','Qiding','苗栗縣竹南鎮崎頂里北戶 55 號'),(48,'竹南','Zhunan','苗栗縣竹南鎮竹南里中山路 166 號'),(49,'談文','Tanwen','苗栗縣造橋鄉談文村仁愛路 29 號'),(50,'大山','Dashan','苗栗縣後龍鎮大山里明山路 180 號'),(51,'後龍','Houlong','苗栗縣後龍鎮北龍里車站街 127-2 號'),(52,'龍港','Longgang','苗栗縣後龍鎮龍京里公司寮 85 號'),(53,'白沙屯','Baishatun','苗栗縣通霄鎮白西里白西 131 號'),(54,'新埔','Xinpu','苗栗縣通霄鎮新埔里新埔 57 號'),(55,'通霄','Tongxiao','苗栗縣通霄鎮通西里中正路 109 號'),(56,'苑裡','Yuanli','苗栗縣苑裡鎮苑北里中山路 165 號'),(57,'日南','Rinan','臺中市大甲區孟春里中山路二段 140 巷 8 號'),(58,'大甲','Dajia','臺中市大甲區大甲里中山路一段 828 號'),(59,'臺中港','Taichung Port','臺中市清水區頂湳里甲南路 2 號'),(60,'清水','Qingshui','臺中市南社里中正街 115 號'),(61,'沙鹿','Shalu','臺中市沙鹿區沙鹿里中正街 94 號'),(62,'龍井','Longjing','臺中市龍井區龍泉里龍新路 1 號'),(63,'大肚','Dadu','臺中市大肚區頂街里平和街 121 號'),(64,'追分','Zhuifen','臺中市大肚區王田里追分街 13 號'),(65,'造橋','Zaoqiao','苗栗縣造橋鄉造橋村平仁路 54 號'),(66,'豐富','Fengfu','苗栗縣後龍鎮校椅里高鐵一路 66 號'),(67,'苗栗','Miaoli','苗栗縣苗栗市上苗里為公路 1 號'),(68,'南勢','Nanshi','苗栗縣苗栗市新英里南勢 39 號'),(69,'銅鑼','Tongluo','苗栗縣銅鑼鄉銅鑼村大同路 13 號'),(70,'三義','Sanyi','苗栗縣三義鄉雙湖村雙湖 90 號'),(71,'基隆','Keelung','基隆市中山區民治里1鄰中山一路16之 1號'),(72,'三坑','Sankeng','基隆市仁愛區德厚里龍安街 206 號'),(73,'八堵','Badu','基隆市暖暖區八南里八堵路 142 號'),(74,'七堵','Qidu','基隆市七堵區長興里東新街 2 號'),(75,'百福','Baifu','基隆市七堵區堵南里明德三路 1 之 1 號'),(76,'五堵','Wudu','新北市汐止區長安里長安路 17 號'),(77,'汐止','Xizhi','新北市汐止區信望里信義路 1 號'),(78,'汐科','Xike','新北市汐止區大同里大同路二段 182 號'),(79,'南港','Nangang','臺北市南港區南港里南港路一段 313 號'),(80,'松山','Songshan','臺北市信義區永吉里松山路 11 號B1'),(81,'臺北','Taipei','臺北市中正區黎明里北平西路 3 號'),(82,'臺北-環島','Taipei Surround Island','臺北市中正區'),(83,'萬華','Wanhua','臺北市萬華區富福里康定路 382 號'),(84,'板橋','Banqiao','新北市板橋區新民里站前路'),(85,'浮洲','Fuzhou','新北市板橋區僑中里僑中二街 156 號'),(86,'樹林','Shulin','新北市樹林區樹北里鎮前街 112 號'),(87,'南樹林','South Shulin','新北市樹林區東山里中山路二段 230 號'),(88,'山佳','Shanjia','新北市樹林區中山里山佳街 28 號'),(89,'鶯歌','Yingge','新北市鶯歌區東鶯里文化路 681號'),(90,'桃園','Taoyuan','桃園市桃園區武陵里中正路 1 號'),(91,'內壢','Neili','桃園市中壢區中原里中華路一段 267 號'),(92,'中壢','Zhongli_Taoyuan','桃園市中壢區石頭里中和路 139 號'),(93,'埔心','Puxin','桃園市楊梅區埔心里永美路 208 號'),(94,'楊梅','Yangmei','桃園市楊梅區楊梅里大成路 256 號'),(95,'富岡','Fugang','桃園市楊梅區富岡里成功路 37 號'),(96,'新富','Xinfu','桃園市楊梅區富豐里富全街 1 號'),(97,'北湖','Beihu','新竹縣湖口鄉東興村北湖路 1 號'),(98,'湖口','Hukou','新竹縣湖口鄉仁勢村中山路二段 121 號'),(99,'新豐','Xinfeng','新竹縣新豐鄉山崎村新興路 202 號'),(100,'竹北','Zhubei','新竹縣竹北市竹義里和平街 59 號'),(101,'北新竹','North Hsinchu','新竹市 東區東園里中華路一段 291 之 2 號'),(102,'千甲','Qianjia','新竹市 東區水源里千甲路 142 號'),(103,'新莊','Xinzhuang','新竹市 東區新莊里關東路 310 號'),(104,'竹中','Zhuzhong','新竹縣竹東鎮頭重里竹中路 145 號'),(105,'六家','Liujia','新竹縣竹北市隘口里復興三路二段 229 號'),(106,'上員','Shangyuan','新竹縣竹東鎮上員里光明路 無站房'),(107,'榮華','Ronghua','新竹縣竹東鎮仁愛里北興路 無站房'),(108,'竹東','Zhudong','新竹縣竹東鎮雞林里東林路 196 號'),(109,'橫山','Hengshan','新竹縣橫山鄉橫山村橫山路 97 號 無站房'),(110,'九讚頭','Jiuzantou','新竹縣橫山鄉大肚村中豐路二段 286 巷 29 號'),(111,'合興','Hexing','新竹縣橫山鄉力行村中山街一段 17 號'),(112,'富貴','Fugui','新竹縣橫山鄉豐田村中山街一段 無站房'),(113,'內灣','Neiwan','新竹縣橫山鄉內灣村中正路 6 號'),(114,'新竹','Hsinchu','新竹市 東區榮光里中華路二段 445 號'),(115,'三姓橋','Sanxingqiao','新竹市 香山區香山里元培街 32 巷 30 號'),(116,'香山','Xiangshan','新竹市 香山區朝山里中華路五段 347 巷 2 弄 27 號'),(117,'崎頂','Qiding','苗栗縣竹南鎮崎頂里北戶 55 號'),(118,'竹南','Zhunan','苗栗縣竹南鎮竹南里中山路 166 號'),(119,'談文','Tanwen','苗栗縣造橋鄉談文村仁愛路 29 號'),(120,'大山','Dashan','苗栗縣後龍鎮大山里明山路 180 號'),(121,'後龍','Houlong','苗栗縣後龍鎮北龍里車站街 1272 號'),(122,'龍港','Longgang','苗栗縣後龍鎮龍京里公司寮 85 號'),(123,'白沙屯','Baishatun','苗栗縣通霄鎮白西里白西 131 號'),(124,'新埔','Xinpu','苗栗縣通霄鎮新埔里新埔 57 號'),(125,'通霄','Tongxiao','苗栗縣通霄鎮通西里中正路 109 號'),(126,'苑裡','Yuanli','苗栗縣苑裡鎮苑北里中山路 165 號'),(127,'日南','Rinan','臺中市大甲區孟春里中山路二段 140 巷 8 號'),(128,'大甲','Dajia','臺中市大甲區大甲里中山路一段 828 號'),(129,'臺中港','Taichung Port','臺中市清水區頂湳里甲南路 2 號'),(130,'清水','Qingshui','臺中市南社里中正街 115 號'),(131,'沙鹿','Shalu','臺中市沙鹿區沙鹿里中正街 94 號'),(132,'龍井','Longjing','臺中市龍井區龍泉里龍新路 1 號'),(133,'大肚','Dadu','臺中市大肚區頂街里平和街 121 號'),(134,'追分','Zhuifen','臺中市大肚區王田里追分街 13 號'),(135,'造橋','Zaoqiao','苗栗縣造橋鄉造橋村平仁路 54 號'),(136,'豐富','Fengfu','苗栗縣後龍鎮校椅里高鐵一路 66 號'),(137,'苗栗','Miaoli','苗栗縣苗栗市上苗里為公路 1 號'),(138,'南勢','Nanshi','苗栗縣苗栗市新英里南勢 39 號'),(139,'銅鑼','Tongluo','苗栗縣銅鑼鄉銅鑼村大同路 13 號'),(140,'三義','Sanyi','苗栗縣三義鄉雙湖村雙湖 90 號'),(141,'基隆','Keelung','基隆市中山區民治里1鄰中山一路16之 1號'),(142,'三坑','Sankeng','基隆市仁愛區德厚里龍安街 206 號'),(143,'八堵','Badu','基隆市暖暖區八南里八堵路 142 號'),(144,'七堵','Qidu','基隆市七堵區長興里東新街 2 號'),(145,'百福','Baifu','基隆市七堵區堵南里明德三路 1 之 1 號'),(146,'五堵','Wudu','新北市汐止區長安里長安路 17 號'),(147,'汐止','Xizhi','新北市汐止區信望里信義路 1 號'),(148,'汐科','Xike','新北市汐止區大同里大同路二段 182 號'),(149,'南港','Nangang','臺北市南港區南港里南港路一段 313 號'),(150,'松山','Songshan','臺北市信義區永吉里松山路 11 號B1'),(151,'臺北','Taipei','臺北市中正區黎明里北平西路 3 號'),(152,'臺北-環島','Taipei Surround Island','臺北市中正區'),(153,'萬華','Wanhua','臺北市萬華區富福里康定路 382 號'),(154,'板橋','Banqiao','新北市板橋區新民里站前路'),(155,'浮洲','Fuzhou','新北市板橋區僑中里僑中二街 156 號'),(156,'樹林','Shulin','新北市樹林區樹北里鎮前街 112 號'),(157,'南樹林','South Shulin','新北市樹林區東山里中山路二段 230 號'),(158,'山佳','Shanjia','新北市樹林區中山里山佳街 28 號'),(159,'鶯歌','Yingge','新北市鶯歌區東鶯里文化路 681號'),(160,'桃園','Taoyuan','桃園市桃園區武陵里中正路 1 號'),(161,'內壢','Neili','桃園市中壢區中原里中華路一段 267 號'),(162,'中壢','ZhongliTaoyuan','桃園市中壢區石頭里中和路 139 號'),(163,'埔心','Puxin','桃園市楊梅區埔心里永美路 208 號'),(164,'楊梅','Yangmei','桃園市楊梅區楊梅里大成路 256 號'),(165,'富岡','Fugang','桃園市楊梅區富岡里成功路 37 號'),(166,'新富','Xinfu','桃園市楊梅區富豐里富全街 1 號'),(167,'北湖','Beihu','新竹縣湖口鄉東興村北湖路 1 號'),(168,'湖口','Hukou','新竹縣湖口鄉仁勢村中山路二段 121 號'),(169,'新豐','Xinfeng','新竹縣新豐鄉山崎村新興路 202 號'),(170,'竹北','Zhubei','新竹縣竹北市竹義里和平街 59 號'),(171,'北新竹','North Hsinchu','新竹市 東區東園里中華路一段 291 之 2 號'),(172,'千甲','Qianjia','新竹市 東區水源里千甲路 142 號'),(173,'新莊','Xinzhuang','新竹市 東區新莊里關東路 310 號'),(174,'竹中','Zhuzhong','新竹縣竹東鎮頭重里竹中路 145 號'),(175,'六家','Liujia','新竹縣竹北市隘口里復興三路二段 229 號'),(176,'上員','Shangyuan','新竹縣竹東鎮上員里光明路 無站房'),(177,'榮華','Ronghua','新竹縣竹東鎮仁愛里北興路 無站房'),(178,'竹東','Zhudong','新竹縣竹東鎮雞林里東林路 196 號'),(179,'橫山','Hengshan','新竹縣橫山鄉橫山村橫山路 97 號 無站房'),(180,'九讚頭','Jiuzantou','新竹縣橫山鄉大肚村中豐路二段 286 巷 29 號'),(181,'合興','Hexing','新竹縣橫山鄉力行村中山街一段 17 號'),(182,'富貴','Fugui','新竹縣橫山鄉豐田村中山街一段 無站房'),(183,'內灣','Neiwan','新竹縣橫山鄉內灣村中正路 6 號'),(184,'新竹','Hsinchu','新竹市 東區榮光里中華路二段 445 號'),(185,'三姓橋','Sanxingqiao','新竹市 香山區香山里元培街 32 巷 30 號'),(186,'香山','Xiangshan','新竹市 香山區朝山里中華路五段 347 巷 2 弄 27 號'),(187,'崎頂','Qiding','苗栗縣竹南鎮崎頂里北戶 55 號'),(188,'竹南','Zhunan','苗栗縣竹南鎮竹南里中山路 166 號'),(189,'談文','Tanwen','苗栗縣造橋鄉談文村仁愛路 29 號'),(190,'大山','Dashan','苗栗縣後龍鎮大山里明山路 180 號'),(191,'後龍','Houlong','苗栗縣後龍鎮北龍里車站街 1272 號'),(192,'龍港','Longgang','苗栗縣後龍鎮龍京里公司寮 85 號'),(193,'白沙屯','Baishatun','苗栗縣通霄鎮白西里白西 131 號'),(194,'新埔','Xinpu','苗栗縣通霄鎮新埔里新埔 57 號'),(195,'通霄','Tongxiao','苗栗縣通霄鎮通西里中正路 109 號'),(196,'苑裡','Yuanli','苗栗縣苑裡鎮苑北里中山路 165 號'),(197,'日南','Rinan','臺中市大甲區孟春里中山路二段 140 巷 8 號'),(198,'大甲','Dajia','臺中市大甲區大甲里中山路一段 828 號'),(199,'臺中港','Taichung Port','臺中市清水區頂湳里甲南路 2 號'),(200,'清水','Qingshui','臺中市南社里中正街 115 號'),(201,'沙鹿','Shalu','臺中市沙鹿區沙鹿里中正街 94 號'),(202,'龍井','Longjing','臺中市龍井區龍泉里龍新路 1 號'),(203,'大肚','Dadu','臺中市大肚區頂街里平和街 121 號'),(204,'追分','Zhuifen','臺中市大肚區王田里追分街 13 號'),(205,'造橋','Zaoqiao','苗栗縣造橋鄉造橋村平仁路 54 號'),(206,'豐富','Fengfu','苗栗縣後龍鎮校椅里高鐵一路 66 號'),(207,'苗栗','Miaoli','苗栗縣苗栗市上苗里為公路 1 號'),(208,'南勢','Nanshi','苗栗縣苗栗市新英里南勢 39 號'),(209,'銅鑼','Tongluo','苗栗縣銅鑼鄉銅鑼村大同路 13 號'),(210,'三義','Sanyi','苗栗縣三義鄉雙湖村雙湖 90 號'),(211,'泰安','Taian','臺中市后里區泰安里安眉路 37 之 12 號'),(212,'后里','Houli','臺中市后里區義里里甲后路一段 1 號'),(213,'豐原','Fengyuan','臺中市豐原區豐原里中正路 1 號'),(214,'栗林','Lilin','臺中市潭子區潭豐路二段747號'),(215,'潭子','Tanzi','臺中市潭子區中山路二段3521號'),(216,'頭家厝','Toujiacuo','臺中市潭子區頭張東路43巷8號'),(217,'松竹','Songzhu','臺中市北屯區舊社里松竹路一段1473巷100號'),(218,'太原','Taiyuan','臺中市北屯區北興里東光路 665 號'),(219,'精武','Jingwu','臺中市東區東南里東光路 161號'),(220,'臺中','Taichung','臺中市中區綠川里臺灣大道一段 1 號'),(221,'五權','Wuquan','臺中市南區建國南路二段201號'),(222,'大慶','Daqing','臺中市南區樹德里7鄰大慶街2段130號'),(223,'烏日','Wuri','臺中市烏日區烏日里三民街 258 號'),(224,'新烏日','Xinwuri','臺中市烏日區三和里高鐵東一路 26 號'),(225,'成功','Chenggong','臺中市烏日區榮泉里中山路三段 550 號'),(226,'彰化','Changhua','彰化縣彰化市長樂里三民路 1 號'),(227,'花壇','Huatan','彰化縣花壇鄉花壇村中正路 370 號'),(228,'大村','Dacun','彰化縣大村鄉過溝村福進路 100 號'),(229,'員林','Yuanlin','彰化縣員林市和平里民權街 55 號'),(230,'永靖','Yongjing','彰化縣永靖鄉崙子村永崙路 25 號'),(231,'社頭','Shetou','彰化縣社頭鄉廣興村社站路 10 號'),(232,'田中','Tianzhong','彰化縣田中鎮中路里中州路一段 1 號'),(233,'二水','Ershui','彰化縣二水鄉光化村光文路 1 號'),(234,'源泉','Yuanquan','彰化縣二水鄉合興村英義路 無站房'),(235,'濁水','Zhuoshui','南投縣名間鄉濁水村車站路 15 號'),(236,'龍泉','Longquan','南投縣集集鎮隘寮村龍泉巷 無站房'),(237,'集集','Jiji','南投縣集集鎮吳厝里民生路 75 號'),(238,'水里','Shuili','南投縣水里鄉水里村民生路 440 號'),(239,'車埕','Checheng','南投縣水里鄉車埕村民權巷 2 號'),(240,'林內','Linnei','雲林縣林內鄉林中村中山路 42 號'),(241,'石榴','Shiliu','雲林縣斗六市榴北里文明路 31 號'),(242,'斗六','Douliu','雲林縣斗六市信義里民生路 187 號'),(243,'斗南','Dounan','雲林縣斗南鎮南昌里中山路 2 號'),(244,'石龜','Shigui','雲林縣斗南鎮石龜里'),(245,'大林','Dalin','嘉義縣大林鎮吉林里中山路 2 號'),(246,'民雄','Minxiong','嘉義縣民雄鄉東榮村和平路 2 號'),(247,'嘉北','Jiabei','嘉義市 東區後湖里保建街 110 號'),(248,'嘉義','Chiayi','嘉義市 西區番社里中山路 528 號'),(249,'水上','Shuishang','嘉義縣水上鄉下寮村鴿溪寮 49 號'),(250,'南靖','Nanjing','嘉義縣水上鄉三鎮村三鎮路 26 號'),(251,'後壁','Houbi','臺南市後壁區後壁里後壁 77 號'),(252,'新營','Xinying','臺南市新營區中營里中山路 1 號'),(253,'柳營','Liuying','臺南市柳營區東昇里建國路 1 號'),(254,'林鳳營','Linfengying','臺南市六甲區中社里林鳳營 16 號'),(255,'隆田','Longtian','臺南市官田區隆田里中山路一段 1 號'),(256,'拔林','Balin','臺南市官田區拔林里拔子林 83 之 1 號'),(257,'善化','Shanhua','臺南市善化區光文里中山路 1 號'),(258,'南科','Nanke','臺南市新市區大營里大營 287300 號'),(259,'新市','Xinshi','臺南市新市區新和里中華路 1 號'),(260,'永康','Yongkang','臺南市永康區埔園里中山路 459 號'),(261,'大橋','Daqiao','臺南市永康區西橋里中華路 835 號'),(262,'臺南','Tainan','臺南市東區成大里北門路二段 4 號'),(263,'保安','Baoan','臺南市仁德區保安里文賢路一段 529 巷 10 號'),(264,'仁德','Rende','臺南市仁德區保安里永德路 10 號'),(265,'中洲','Zhongzhou','臺南市仁德區中洲五街236號'),(266,'長榮大學','Chang Jung Christian University','臺南市歸仁區大潭里長大路15 號'),(267,'沙崙','Shalun','臺南市歸仁區沙崙里歸仁大道 102 號'),(268,'大湖','Dahu','高雄市路竹區甲南里天祐路 24 號'),(269,'路竹','Luzhu','高雄市路竹區竹南里中正路 288 號'),(270,'岡山','Gangshan','高雄市岡山區碧紅里岡燕路 111 號'),(271,'橋頭','Qiaotou','高雄市橋頭區橋頭里站前街 14 號'),(272,'楠梓','Nanzi','高雄市惠楠里建楠路 229 號'),(273,'新左營','Xinzuoying','高雄市左營區尾北里站前北路 1 號'),(274,'左營','Zuoying','高雄市左營區翠華路1050號地下1層'),(275,'內惟','Neiwei','高雄市鼓山區翠華路500號地下1層'),(276,'美術館','Museum of Fine Arts','高雄市鼓山區翠華路246號'),(277,'鼓山','Gushan','高雄市鼓山區鐵路街20巷6號'),(278,'三塊厝','Sankuaicuo','高雄市三民區德北里6鄰康平街1號'),(279,'高雄','Kaohsiung','高雄市三民區港西里建國二路 318 號'),(280,'民族','Minzu','高雄市三民區博惠里14鄰凱旋一路260號'),(281,'科工館','Science And Technology Museum','高雄市三民區寶盛里15鄰大順三路307號'),(282,'正義','Zhengyi','高雄市苓雅區建軍里正義路 308 號 B1'),(283,'鳳山','Fongshan','高雄市鳳山區曹公里曹公路 137 號'),(284,'後庄','Houzhuang','高雄市大寮區後庄里民慶街 9 號'),(285,'九曲堂','Jiuqutang','高雄市大樹區久堂里久堂路鐵路巷 15 號'),(286,'六塊厝','Liukuaicuo','屏東縣屏東市長安里光復路 392 號'),(287,'屏東','Pingtung','屏東縣屏東市擇仁里公勇路 62 號'),(288,'歸來','Guilai','屏東縣屏東市歸來里歸仁路 5 之 4 號'),(289,'麟洛','Linluo','屏東縣麟洛鄉田道村中華路站前巷 15 號'),(290,'西勢','Xishi','屏東縣竹田鄉西勢村西豐路 2 號'),(291,'竹田','Zhutian','屏東縣竹田鄉履豐村豐明路29 號'),(292,'潮州','Chaozhou','屏東縣潮州鎮新榮里信義路 111 號'),(293,'崁頂','Kanding','屏東縣崁頂鄉崁頂村中正路 122 號'),(294,'南州','Nanzhou','屏東縣南州鄉仁里村仁里路 86 號'),(295,'鎮安','Zhenan','屏東縣林邊鄉鎮安村永和路 4 號'),(296,'林邊','Linbian','屏東縣林邊鄉仁和村仁愛路 33 號'),(297,'佳冬','Jiadong','屏東縣佳冬鄉六根村復興路21號'),(298,'東海','Donghai','屏東縣枋寮鄉東海村西安路 92 號'),(299,'枋寮','Fangliao','屏東縣枋寮鄉枋寮村儲運路 18 號'),(300,'加祿','Jialu','屏東縣枋山鄉加祿村會社 53 號'),(301,'內獅','Neishi','屏東縣枋山鄉加祿村南和 43 號'),(302,'枋山','Fangshan','屏東縣獅子鄉內獅村內獅巷 84 號'),(303,'枋野','Fangye','屏東縣獅子鄉內獅村內獅巷 88 號'),(304,'大武','Dawu','臺東縣大武鄉大鳥村和平部落 33 號'),(305,'瀧溪','Longxi','臺東縣太麻里鄉多良村大溪 37 號'),(306,'金崙','Jinlun','臺東縣太麻里鄉金崙村金崙 47 之 17 號'),(307,'太麻里','Taimali','臺東縣太麻里鄉大王村站前路 2 號'),(308,'知本','Zhiben','臺東縣臺東市知本里知本路二段 900 巷 85 號'),(309,'康樂','Kangle','臺東縣臺東市康樂里博物館路 51 巷 131 號'),(310,'潮州基地','Chaozhou Railway Workshop','屏東縣潮州鎮光春里光復路 616 號'),(311,'臺東','Taitung','臺東縣臺東市岩灣里岩灣路 101 巷 598 號'),(312,'山里','Shanli','臺東縣卑南鄉嘉豐村山里路 108 號'),(313,'鹿野','Luye','臺東縣鹿野鄉鹿野村中正路 38 號'),(314,'瑞源','Ruiyuan','臺東縣鹿野鄉瑞源村瑞景路一段 336 巷 8 號 之 1'),(315,'瑞和','Ruihe','臺東縣鹿野鄉瑞和村瑞景路三段 1 之 1 號'),(316,'關山','Guanshan','臺東縣關山鎮里壠里博愛路 2 號'),(317,'海端','Haiduan','臺東縣關山鎮德高里西莊 49 號'),(318,'池上','Chishang','臺東縣池上鄉福文村鐵花路 30 號'),(319,'富里','Fuli','花蓮縣富里鄉富里村車站街 56 號'),(320,'東竹','Dongzhu','花蓮縣富里鄉新興村新興 26 號'),(321,'東里','Dongli','花蓮縣富里鄉東里村大莊路 15 之 6 號'),(322,'玉里','Yuli','花蓮縣玉里鎮中城里康樂街 39 號'),(323,'三民','Sanmin','花蓮縣玉里鎮三民里三民 10 號'),(324,'瑞穗','Ruisui','花蓮縣瑞穗鄉瑞穗村四維街 13 號'),(325,'富源','Fuyuan','花蓮縣瑞穗鄉富源村富源路 2 號'),(326,'大富','Dafu','花蓮縣光復鄉大富村明德路 1 號'),(327,'光復','Guangfu','花蓮縣光復鄉大安村中正路一段 2 之 1 號'),(328,'萬榮','Wanrong','花蓮縣鳳林鎮長橋里長德街 17 號'),(329,'鳳林','Fenglin','花蓮縣鳳林鎮鳳智里中山路 43 號'),(330,'南平','Nanping','花蓮縣鳳林鎮南平里自強路 233 號'),(331,'林榮新光','Linrong Shin Kong','花蓮縣鳳林鎮兆豐路800號'),(332,'豐田','Fengtian','花蓮縣壽豐鄉豐山村站前街 36 號'),(333,'壽豐','Shoufeng','花蓮縣壽豐鄉壽豐村壽山路 1 號'),(334,'平和','Pinghe','花蓮縣壽豐鄉平和村平和路 1 號'),(335,'志學','Zhixue','花蓮縣壽豐鄉志學村中正路 1 號'),(336,'吉安','Jian','花蓮縣吉安鄉南昌村南昌路1號'),(337,'花蓮','Hualien','花蓮縣花蓮市國聯里國聯一路 100 號'),(338,'北埔','Beipu','花蓮縣新城鄉北埔村自強街 113 號'),(339,'景美','Jingmei','花蓮縣秀林鄉景美村加灣 178 之 1 號'),(340,'新城','Xincheng','花蓮縣新城鄉新城村新興一路 73 號'),(341,'崇德','Chongde','花蓮縣秀林鄉崇德村海濱路 96 號'),(342,'和仁','Heren','花蓮縣秀林鄉和平村和仁 71 號'),(343,'和平','Heping','花蓮縣秀林鄉和平村和平 276 號'),(344,'漢本','Hanben','宜蘭縣南澳鄉澳花村蘇花路一段 56 號'),(345,'武塔','Wuta','宜蘭縣南澳鄉武塔村新溪路 18 號'),(346,'南澳','Nanao','宜蘭縣蘇澳鎮南強里大通路 22 號'),(347,'東澳','Dongao','宜蘭縣南澳鄉東岳村東岳路 1 號'),(348,'永樂','Yongle','宜蘭縣蘇澳鎮永樂里圳頭路 60 號'),(349,'蘇澳','Suao','宜蘭縣蘇澳鎮蘇南里太平路 1 號'),(350,'蘇澳新','Suaoxin','宜蘭縣蘇澳鎮聖愛里中山路二段 238 之 1 號'),(351,'新馬','Xinma','宜蘭縣蘇澳鎮新城里中山路二段 322 號'),(352,'冬山','Dongshan','宜蘭縣冬山鄉冬山村中正路 1 號'),(353,'羅東','Luodong','宜蘭縣羅東鎮大新里公正路 2 號'),(354,'中里','ZhongliYilan','宜蘭縣五結鄉中興村台興路 10 號'),(355,'二結','Erjie','宜蘭縣五結鄉五結中路三段658巷8號'),(356,'宜蘭','Yilan','宜蘭縣宜蘭市和睦里光復路 1 號'),(357,'四城','Sicheng','宜蘭縣礁溪鄉吳沙村站前路 24 號'),(358,'礁溪','Jiaoxi','宜蘭縣礁溪鄉德陽村溫泉路 1 號'),(359,'頂埔','Dingpu','宜蘭縣頭城鎮下埔里下埔路 4 之 8 號'),(360,'頭城','Toucheng','宜蘭縣頭城鎮纘祥路 59 號'),(361,'外澳','Waiao','宜蘭縣頭城鎮濱海路二段 217 號'),(362,'龜山','Guishan','宜蘭縣頭城鎮更新里濱海路三段 261 號'),(363,'大溪','Daxi','宜蘭縣頭城鎮濱海路五段 63 號'),(364,'大里','Dali','宜蘭縣頭城鎮大里里濱海路六段 326 號'),(365,'石城','Shicheng','宜蘭縣頭城鎮濱海路七段 230 號'),(366,'福隆','Fulong','新北市貢寮區福隆里福隆街 2 號'),(367,'貢寮','Gongliao','新北市貢寮區貢寮里朝陽街 33 號'),(368,'雙溪','Shuangxi','新北市雙溪區新基里朝陽街 1 號'),(369,'牡丹','Mudan','新北市雙溪區牡丹里51號'),(370,'三貂嶺','Sandiaoling','新北市瑞芳區碩仁里魚寮路 1 號'),(371,'大華','Dahua','新北市平溪區南山里六分 12 之 1 號'),(372,'十分','Shifen','新北市平溪區十分里十分街 51 號'),(373,'望古','Wanggu','新北市平溪區望古里 無站房'),(374,'嶺腳','Lingjiao','新北市平溪區嶺腳里嶺腳寮 22 號'),(375,'平溪','Pingxi','新北市平溪區平溪里中華街 12 號'),(376,'菁桐','Jingtong','新北市平溪區菁桐里菁桐街 52 號'),(377,'猴硐','Houtong','新北市瑞芳區光復里柴寮路 70 號'),(378,'瑞芳','Ruifang','新北市瑞芳區龍潭里明燈路三段 82 號'),(379,'海科館','Haikeguan','基隆市中正區長潭里'),(380,'八斗子','Badouzi','基隆市中正區砂子里省道臺 2 線 與新北市瑞芳區交界處、無站房'),(381,'四腳亭','Sijiaoting','新北市瑞芳區吉慶里中央路 65 號'),(382,'暖暖','Nuannuan','基隆市暖暖區暖暖里暖暖街 51 號');
/*!40000 ALTER TABLE `twtrainall` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-06-25 18:23:36
